backend/templates/CadastraTicketGuardian.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://toledobrasil.com.br/WS_Guardian">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:CadastraTicketGuardian>
         <!--Optional:-->
         <ws:DadosTicket>
            <!--Optional:-->
            <ws:Codigo>?</ws:Codigo>
            <!--Optional:-->
            <ws:PlacaCarreta>?</ws:PlacaCarreta>
            <!--Optional:-->
            <ws:PlacaVeiculo>?</ws:PlacaVeiculo>
            <!--Optional:-->
            <ws:Transportadora>
               <!--Optional:-->
               <ws:Codigo>?</ws:Codigo>
               <!--Optional:-->
               <ws:Descricao>?</ws:Descricao>
               <ws:Sequencial>?</ws:Sequencial>
               <!--Optional:-->
               <ws:RazaoSocial>?</ws:RazaoSocial>
               <!--Optional:-->
               <ws:Cnpj>?</ws:Cnpj>
               <!--Optional:-->
               <ws:InscricaoEstadual>?</ws:InscricaoEstadual>
               <!--Optional:-->
               <ws:Endereco>?</ws:Endereco>
               <!--Optional:-->
               <ws:Complemento>?</ws:Complemento>
               <!--Optional:-->
               <ws:Municipio>?</ws:Municipio>
               <!--Optional:-->
               <ws:UF>?</ws:UF>
               <!--Optional:-->
               <ws:Cep>?</ws:Cep>
               <!--Optional:-->
               <ws:Telefone>?</ws:Telefone>
               <!--Optional:-->
               <ws:Observacao>?</ws:Observacao>
               <!--Optional:-->
               <ws:Email>?</ws:Email>
               <ws:Estado>?</ws:Estado>
               <ws:TipoDocumento>?</ws:TipoDocumento>
               <ws:IncluiAtualiza>?</ws:IncluiAtualiza>
            </ws:Transportadora>
            <!--Optional:-->
            <ws:Emissor>
               <!--Optional:-->
               <ws:Codigo>?</ws:Codigo>
               <!--Optional:-->
               <ws:Descricao>?</ws:Descricao>
               <ws:Sequencial>?</ws:Sequencial>
               <ws:TipoEmissor>?</ws:TipoEmissor>
               <!--Optional:-->
               <ws:RazaoSocial>?</ws:RazaoSocial>
               <!--Optional:-->
               <ws:Cnpj>?</ws:Cnpj>
               <!--Optional:-->
               <ws:InscricaoEstadual>?</ws:InscricaoEstadual>
               <!--Optional:-->
               <ws:Endereco>?</ws:Endereco>
               <!--Optional:-->
               <ws:Complemento>?</ws:Complemento>
               <!--Optional:-->
               <ws:Municipio>?</ws:Municipio>
               <!--Optional:-->
               <ws:UF>?</ws:UF>
               <!--Optional:-->
               <ws:Cep>?</ws:Cep>
               <!--Optional:-->
               <ws:Telefone>?</ws:Telefone>
               <!--Optional:-->
               <ws:Email>?</ws:Email>
               <!--Optional:-->
               <ws:Observacao>?</ws:Observacao>
               <ws:Estado>?</ws:Estado>
               <ws:TipoDocumento>?</ws:TipoDocumento>
               <ws:IncluiAtualiza>?</ws:IncluiAtualiza>
            </ws:Emissor>
            <!--Optional:-->
            <ws:Motorista>
               <!--Optional:-->
               <ws:Codigo>?</ws:Codigo>
               <!--Optional:-->
               <ws:Descricao>?</ws:Descricao>
               <ws:Sequencial>?</ws:Sequencial>
               <!--Optional:-->
               <ws:Cpf>?</ws:Cpf>
               <!--Optional:-->
               <ws:Rg>?</ws:Rg>
               <!--Optional:-->
               <ws:Nome>?</ws:Nome>
               <!--Optional:-->
               <ws:Cnh>?</ws:Cnh>
               <ws:Estado>?</ws:Estado>
               <!--Optional:-->
               <ws:Observacao>?</ws:Observacao>
               <!--Optional:-->
               <ws:InfoAcompanhantes>?</ws:InfoAcompanhantes>
               <!--Optional:-->
               <ws:Nacionalidade>?</ws:Nacionalidade>
               <ws:DataNascimento>?</ws:DataNascimento>
               <!--Optional:-->
               <ws:DocEstrangeiro>?</ws:DocEstrangeiro>
               <ws:IncluiAtualiza>?</ws:IncluiAtualiza>
               <!--Optional:-->
               <ws:OrgaoExpedidorRG>?</ws:OrgaoExpedidorRG>
               <ws:UFRG>?</ws:UFRG>
               <!--Optional:-->
               <ws:Identificador>?</ws:Identificador>
               <!--Optional:-->
               <ws:LoginGuardianFacil>?</ws:LoginGuardianFacil>
               <!--Optional:-->
               <ws:Celular>?</ws:Celular>
               <!--Optional:-->
               <ws:Email>?</ws:Email>
            </ws:Motorista>
            <!--Optional:-->
            <ws:Item>
               <!--Zero or more repetitions:-->
               <ws:ItemIntegracao>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
                  <!--Optional:-->
                  <ws:Descricao>?</ws:Descricao>
                  <ws:Sequencial>?</ws:Sequencial>
                  <ws:Tipo>?</ws:Tipo>
                  <!--Optional:-->
                  <ws:Nome>?</ws:Nome>
                  <!--Optional:-->
                  <ws:Informacao>?</ws:Informacao>
                  <ws:PesoUnitario>?</ws:PesoUnitario>
                  <!--Optional:-->
                  <ws:UnidadeMedida>?</ws:UnidadeMedida>
                  <ws:PodeConverter>?</ws:PodeConverter>
                  <ws:FatorConversao>?</ws:FatorConversao>
                  <!--Optional:-->
                  <ws:UnidadeMedidaConversao>?</ws:UnidadeMedidaConversao>
                  <ws:UtilizaContador>?</ws:UtilizaContador>
                  <ws:InicioContador>?</ws:InicioContador>
                  <ws:FinalContador>?</ws:FinalContador>
                  <ws:PrefixoContador>?</ws:PrefixoContador>
                  <ws:Estado>?</ws:Estado>
                  <!--Optional:-->
                  <ws:CodigoFatorCorrecao>?</ws:CodigoFatorCorrecao>
                  <!--Optional:-->
                  <ws:CodigoFluxo>?</ws:CodigoFluxo>
                  <ws:InicialObrigatoria>?</ws:InicialObrigatoria>
                  <ws:QuantidadeViasRelatorioImpressas>?</ws:QuantidadeViasRelatorioImpressas>
                  <ws:IncluiAtualiza>?</ws:IncluiAtualiza>
               </ws:ItemIntegracao>
            </ws:Item>
            <!--Optional:-->
            <ws:Documentos>
               <!--Zero or more repetitions:-->
               <ws:Documento>
                  <!--Optional:-->
                  <ws:Descricao>?</ws:Descricao>
                  <ws:PesoOrigem>?</ws:PesoOrigem>
                  <ws:Estado>?</ws:Estado>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
                  <ws:Data>?</ws:Data>
                  <ws:PesagemRealizada>?</ws:PesagemRealizada>
                  <ws:Tolerancia>?</ws:Tolerancia>
               </ws:Documento>
            </ws:Documentos>
            <!--Optional:-->
            <ws:Observacao>?</ws:Observacao>
            <ws:DataPesagem>?</ws:DataPesagem>
            <!--Optional:-->
            <ws:FatoresCorrecao>
               <!--Zero or more repetitions:-->
               <ws:ListaFatoresCorrecaoTicket>
                  <ws:Numero>?</ws:Numero>
                  <!--Optional:-->
                  <ws:Descricao>?</ws:Descricao>
                  <ws:Data>?</ws:Data>
                  <ws:Estado>?</ws:Estado>
                  <!--Optional:-->
                  <ws:CodigoItem>?</ws:CodigoItem>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
                  <ws:Fator>?</ws:Fator>
                  <ws:ValorMinimo>?</ws:ValorMinimo>
                  <ws:ValorMaximo>?</ws:ValorMaximo>
               </ws:ListaFatoresCorrecaoTicket>
            </ws:FatoresCorrecao>
            <!--Optional:-->
            <ws:FatorCorrecao>
               <ws:TipoFatorCorrecao>?</ws:TipoFatorCorrecao>
               <!--Optional:-->
               <ws:CodigoTabela>?</ws:CodigoTabela>
               <!--Optional:-->
               <ws:ListaFatorCorrecao>
                  <!--Zero or more repetitions:-->
                  <ws:VOListaFatorCorrecao>
                     <ws:Numero>?</ws:Numero>
                     <!--Optional:-->
                     <ws:Descricao>?</ws:Descricao>
                     <ws:Valor>?</ws:Valor>
                  </ws:VOListaFatorCorrecao>
               </ws:ListaFatorCorrecao>
            </ws:FatorCorrecao>
            <!--Optional:-->
            <ws:CamposAdicionais>
               <!--Zero or more repetitions:-->
               <ws:CampoAdicionalTicket>
                  <ws:Numero>?</ws:Numero>
                  <!--Optional:-->
                  <ws:Valor>?</ws:Valor>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
                  <ws:Data>?</ws:Data>
               </ws:CampoAdicionalTicket>
            </ws:CamposAdicionais>
            <!--Optional:-->
            <ws:TagAssociado>?</ws:TagAssociado>
            <!--Optional:-->
            <ws:UnidadeAposConversao>?</ws:UnidadeAposConversao>
            <!--Optional:-->
            <ws:TipoVeiculo>?</ws:TipoVeiculo>
            <ws:AceitaPesoLiquidoZero>?</ws:AceitaPesoLiquidoZero>
            <ws:PesoAlvo>?</ws:PesoAlvo>
            <ws:Corte>?</ws:Corte>
            <ws:DosagemLenta>?</ws:DosagemLenta>
            <ws:PesoBruto>?</ws:PesoBruto>
            <ws:Tara>?</ws:Tara>
            <ws:PesoBrutoOrigem>?</ws:PesoBrutoOrigem>
            <ws:PesoMinimoOrigem>?</ws:PesoMinimoOrigem>
            <ws:PesoMaximoOrigem>?</ws:PesoMaximoOrigem>
            <ws:PesoTotalOrigem>?</ws:PesoTotalOrigem>
            <!--Optional:-->
            <ws:Fluxo>?</ws:Fluxo>
            <ws:TipoDoFatorDeCorrecao>?</ws:TipoDoFatorDeCorrecao>
            <!--Optional:-->
            <ws:OperacaoPreCadastro>?</ws:OperacaoPreCadastro>
            <!--Optional:-->
            <ws:OperacaoDaPesagemInicial>?</ws:OperacaoDaPesagemInicial>
            <!--Optional:-->
            <ws:PerifericoDaPesagemInicial>?</ws:PerifericoDaPesagemInicial>
            <ws:PesoDaPesagemInicial>?</ws:PesoDaPesagemInicial>
            <ws:DataDaPesagemInicial>?</ws:DataDaPesagemInicial>
            <!--Optional:-->
            <ws:EmbalagensTicket>
               <!--Zero or more repetitions:-->
               <ws:EmbalagensTicket>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
                  <!--Optional:-->
                  <ws:Nome>?</ws:Nome>
                  <!--Optional:-->
                  <ws:Identificador>?</ws:Identificador>
                  <ws:Data>?</ws:Data>
                  <ws:Peso>?</ws:Peso>
                  <ws:Quantidade>?</ws:Quantidade>
                  <ws:Sequencial>?</ws:Sequencial>
                  <ws:SequencialItem>?</ws:SequencialItem>
                  <ws:SequencialTck>?</ws:SequencialTck>
                  <ws:CodigoTck>?</ws:CodigoTck>
                  <!--Optional:-->
                  <ws:CodigoItem>?</ws:CodigoItem>
               </ws:EmbalagensTicket>
            </ws:EmbalagensTicket>
            <!--Optional:-->
            <ws:ListaEmbalagensTicket>
               <!--Zero or more repetitions:-->
               <ws:VOEmbalagensTicket>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
                  <!--Optional:-->
                  <ws:Nome>?</ws:Nome>
                  <!--Optional:-->
                  <ws:Identificador>?</ws:Identificador>
                  <ws:Peso>?</ws:Peso>
                  <ws:Quantidade>?</ws:Quantidade>
                  <ws:IncluiAtualiza>?</ws:IncluiAtualiza>
                  <ws:Tipo>?</ws:Tipo>
                  <ws:Sequencial>?</ws:Sequencial>
                  <ws:Estado>?</ws:Estado>
               </ws:VOEmbalagensTicket>
            </ws:ListaEmbalagensTicket>
            <!--Optional:-->
            <ws:Usuario>?</ws:Usuario>
            <!--Optional:-->
            <ws:ReferenciaIntegracao>?</ws:ReferenciaIntegracao>
            <ws:NumeroTotalCompatimentos>?</ws:NumeroTotalCompatimentos>
            <ws:TipoIdentificacaoCompartimento>?</ws:TipoIdentificacaoCompartimento>
            <ws:MarcardoParaCancelar>?</ws:MarcardoParaCancelar>
            <ws:OCRMarcardoParaNaoValida>?</ws:OCRMarcardoParaNaoValida>
            <ws:MotoristaMarcardoParaNaoValida>?</ws:MotoristaMarcardoParaNaoValida>
            <ws:TempoEntreOperacoesMarcadoParaNaoValidar>?</ws:TempoEntreOperacoesMarcadoParaNaoValidar>
            <ws:NumeroConteineres>?</ws:NumeroConteineres>
            <!--Optional:-->
            <ws:Conteineres>
               <!--Zero or more repetitions:-->
               <ws:ConteinerVO>
                  <ws:Sequencial>?</ws:Sequencial>
                  <!--Optional:-->
                  <ws:Descricao>?</ws:Descricao>
                  <!--Optional:-->
                  <ws:Conteiner>?</ws:Conteiner>
                  <ws:Data>?</ws:Data>
                  <ws:TicketSequencial>?</ws:TicketSequencial>
                  <!--Optional:-->
                  <ws:Codigo>?</ws:Codigo>
               </ws:ConteinerVO>
            </ws:Conteineres>
            <!--Optional:-->
            <ws:PontosDoFluxo>
               <!--Zero or more repetitions:-->
               <ws:PontoDoFluxo>
                  <ws:Sequencia>?</ws:Sequencia>
                  <!--Optional:-->
                  <ws:CodigoOperacao>?</ws:CodigoOperacao>
                  <!--Optional:-->
                  <ws:EstacaoControle>?</ws:EstacaoControle>
               </ws:PontoDoFluxo>
            </ws:PontosDoFluxo>
            <!--Optional:-->
            <ws:CodigoContrato>?</ws:CodigoContrato>
            <!--Optional:-->
            <ws:CodigoCalculoFatorCorrecao>?</ws:CodigoCalculoFatorCorrecao>
            <!--Optional:-->
            <ws:CarretasSecundarias>
               <!--Zero or more repetitions:-->
               <ws:VOPlacaSecundaria>
                  <!--Optional:-->
                  <ws:PlacaCarreta>?</ws:PlacaCarreta>
               </ws:VOPlacaSecundaria>
            </ws:CarretasSecundarias>
            <ws:AgendaCloud>?</ws:AgendaCloud>
            <!--Optional:-->
            <ws:ConfiguracoesFila>
               <!--Optional:-->
               <ws:Codigo>?</ws:Codigo>
               <ws:PriorizarTicket>?</ws:PriorizarTicket>
            </ws:ConfiguracoesFila>
         </ws:DadosTicket>
      </ws:CadastraTicketGuardian>
   </soapenv:Body>
</soapenv:Envelope>